       IDENTIFICATION DIVISION.
       PROGRAM-ID. calc.

       DATA DIVISION.
       LINKAGE SECTION.
       01  LS-SALARY PIC 9(5)V99.

       PROCEDURE DIVISION USING LS-SALARY.
           COMPUTE LS-SALARY = LS-SALARY * 1.10
           EXIT PROGRAM.
