       IDENTIFICATION DIVISION.
       PROGRAM-ID. HelloWorld.
       PROCEDURE DIVISION.
       DISPLAY 'Hello, COBOL World!'.
       STOP RUN.
       
